// ++ Автор: Рыбаков 25.0.2026
#Область ПрограммныйИнтерфейс
// Перечень дополняемых форм
// Параметры:
//форма - структура - указание формы
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда	
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(форма);  
		ДобавитьГруппаСкидкаВГруппаШапкаЛево(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛевоГруппаСкидка(форма);
		ДобавитьКнопкаПересчетВГруппаШапкаЛевоГруппаСкидка(форма);
	ИначеЕсли   ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда	
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(форма);	 
	ИначеЕсли   ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда	
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(форма);		
	ИначеЕсли   ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда	
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(форма);			
	ИначеЕсли   ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда	
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(форма);		
	КонецЕсли;	
	
КонецПроцедуры
	
#КонецОбласти   

#Область СлужебныеПроцедурыИФункции    

 Процедура ДобавитьГруппаСкидкаВГруппаШапкаЛево(Форма)
		
	ГруппаСкидка = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево);	 
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;

КонецПроцедуры 

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Р1_КонтактноеЛицо"; 	

КонецПроцедуры      

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Р1_КонтактноеЛицо"; 	

КонецПроцедуры     

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛевоГруппаСкидка(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Р1_СогласованнаяСкидка"; 	    
	ПолеВвода.УстановитьДействие("ПриИзменении", "Р1_Р1_СогласованнаяСкидкаПриИзмененииПосле");
		
КонецПроцедуры      

Процедура ДобавитьКнопкаПересчетВГруппаШапкаЛевоГруппаСкидка(Форма)
	
	Кнопка = Форма.Элементы.Добавить("Пересчет", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка);
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;  
	Кнопка.ИмяКоманды = "Пересчет"; 	
	Кнопка.Доступность = Истина;
	Кнопка.Видимость = Истина;
	
КонецПроцедуры

#КонецОбласти       

//  --
